# Pandas

# file Read Write operation

In [30]:
import numpy as np
import pandas as pd

In [31]:
import pandas as pd

# draft1 = pd.read_table('C:/Users/suresh/Downloads/examples/ex1.csv')  # Supply the file name(path) and Read a csv into a DataFrame
# draft1 = pd.read_table(r'C:\Users\suresh\Downloads\examples\ex1.csv') # Supply the file name(path) and Read a csv into a DataFrame

draft1 = pd.read_csv('ex1.csv') # Supply the file name (path) # By default header='infer' means pandas will treat line in dataset as column names 

draft1  # Pandas will treat first line in ex1.csv as columns by default

type(draft1) # Data Frame is structure table format 

draft1.head() # will return first 5 rows by default 

draft1.head(2) # will return first 2 rows

draft1.tail() # will return last 5 rows by default

draft1.tail(2) # will return last 2 rows

   a   b   c   d message
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
# Read tab seprated values dataset using read_tsv() function
draft2 = pd.read_table('test.tsv')  # Read a tsv into a DataFrame (Tab seprated file)

draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [33]:
# We can read tsv file using read_csv() function
draft2 = pd.read_csv('test.tsv',sep='\t')

draft2

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [34]:
# Read csv file using read_tsv() function
draft1 = pd.read_table('ex1.csv',sep=',')
draft1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
# While reading csv file If we pass header = None it will not consider first line in dataset as column values
# Pandas will assign columns valuse from 0 to n
draft1 = pd.read_csv('ex1.csv',header=None)
draft1

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [36]:
# Giving our own Header or column names to the dataframe
draft1  = pd.read_csv('ex1.csv',names=["aaa","bbb","ccc","ddd","eee"])
draft1

  aaa bbb ccc ddd      eee
0   a   b   c   d  message
1   1   2   3   4    hello
2   5   6   7   8    world
3   9  10  11  12      foo

In [37]:
# If we give less number of columns there will be a problem
# In this case every column move from right to left see in the output cell
# Data frame Structure will change 
draft1  = pd.read_csv('ex1.csv',names=["aaa","bbb","ccc","ddd"])
draft1

  aaa bbb ccc      ddd
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [38]:
# If we give more number of columns, exceeded column  will take row valuse as Nan
# See the output in the below cell
draft1  = pd.read_csv('ex1.csv',names=["aaa","bbb","ccc","ddd","eee","fff"])
draft1

  aaa bbb ccc ddd      eee  fff
0   a   b   c   d  message  NaN
1   1   2   3   4    hello  NaN
2   5   6   7   8    world  NaN
3   9  10  11  12      foo  NaN

In [39]:
parsed = pd.read_csv('csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [40]:
# Coverting Key1 into row index
parsed = pd.read_csv('csv_mindex.csv',index_col=['key1'])
parsed

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

In [41]:
# Coverting Key1 and key2 into row index's (Index inside Index)
parsed = pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [42]:
#Skipping rows in dataset (Remove Junk Data)
pd.read_csv('ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [43]:
result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
# Checking Null values
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [45]:
result = pd.read_csv('ex5.csv',na_values=['one']) # Replace original values with Nan
result

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
# Reading Excel Data
excel_data = pd.read_excel('test.xlsx')
excel_data

   Number Name
0       1    a
1       2    b
2       3    c
3       4    d
4       5    e
5       6    f
6       7    g
7       8    h
8       9    i
9      10    j

In [47]:
# Reading Excel Data with sheet name
excel_data = pd.read_excel('test.xlsx',sheet_name='Sheet2')
excel_data

   data   s.no
0     1    sas
1     2    sds
2     3  dsads
3     4  dsads

In [48]:
# Reading data from URL
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url
BB_data

# BB_data[0].ix[:, 0:20].head(5)      # Check 5 rows (10 columns only)

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [49]:
type(BB_data)                   # store the data in the form of List

list

In [50]:
type(BB_data[0])

pandas.core.frame.DataFrame

In [51]:
BB_data[0]

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [52]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",sep='\t')
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [53]:
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [54]:
type(titanic_train)

pandas.core.frame.DataFrame

In [55]:
titanic_train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [56]:
titanic_train.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [57]:
titanic_train.dtypes # Check data type of each column

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [58]:
titanic_train.columns # Get the list of columns in a titanic dataset

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [59]:
titanic_train['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [60]:
type(titanic_train['Name']) # Data Frame is combination of rows and columns. When we are trying to get any one row or one column of data in that case result type is series

pandas.core.series.Series

In [61]:
titanic_train['Name'].head(2) # Getting selected column data

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
Name: Name, dtype: object

In [62]:
type(titanic_train[["PassengerId",'Survived']])

pandas.core.frame.DataFrame

In [63]:
type(titanic_train[["PassengerId"]]) # Even If you are trying to get one column data it will say type of result is Data Frame i.e because you are passing column name in a list

pandas.core.frame.DataFrame

In [64]:
titanic_train[["PassengerId",'Survived']].head(5) # Head() always read entire dataset and after that it will give top 5 or 10 records based on arguments

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

In [65]:
pd.options.display.max_rows = 10 # Instead of reading million of records from dataset this option reads only top 10 records

In [66]:
result = pd.read_csv('ex6.csv',nrows=5) # Instead of reading entire dataset this will read only top 5 records from the dataset
result
type(result)

pandas.core.frame.DataFrame

In [67]:
chunk = pd.read_csv('ex6.csv',chunksize=1000) # It will prevent to loading entire data and reading entire dataset
chunk

In [68]:
type(pd.read_csv('ex6.csv',chunksize=1000))

pandas.io.parsers.TextFileReader

In [69]:
data = pd.read_csv('ex5.csv')
data
type(data)

pandas.core.frame.DataFrame

In [83]:
data.to_csv('out.csv') # storing data/dataframe into a csv file

In [84]:
# data.to_csv(sys.stdout,na_rep='NULL')

In [85]:
BB_data[0].to_csv('BB_data.csv') # storing data/dataframe into a csv file

In [86]:
data.to_csv('out1.csv',sep='@',index=False,header=False) # storing data/dataframe into a csv file with @ Separator and Removing the index's and Header

In [89]:
BB_data[0].to_csv('BB_data.csv',index=False,header=False)  # Removing the Header or columns values

In [94]:
BB = pd.read_csv('BB_data.csv',header=None) # Reading csv file with out Header
BB

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [96]:
import sys
data.to_csv(sys.stdout,na_rep='NULL')
data

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [105]:
# Create custom dataset and convert intio data frame
d = {'col1':[1,2],'col2':[2,3]}
da  = pd.DataFrame(data = d,index=['s1','s2'])
da.to_csv('x.csv')

In [106]:
pd.read_csv('x.csv',index_col=[0])

    col1  col2
s1     1     2
s2     2     3

In [107]:
# Pandas -2

In [108]:
#Generating the Dates with frequency = Day
dates = pd.date_range('1/1/2000',periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [109]:
#Generating the Dates with frequency = Day
dates = pd.date_range('1/1/2000',periods=7,freq='M')
dates

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30', '2000-07-31'],
              dtype='datetime64[ns]', freq='M')

In [110]:
#Generating the Dates with frequency = Day
dates = pd.date_range('1/1/2000',periods=7,freq='Y')
dates

DatetimeIndex(['2000-12-31', '2001-12-31', '2002-12-31', '2003-12-31',
               '2004-12-31', '2005-12-31', '2006-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [125]:
# Range() will accept only integers but arange() will accept float also
np.arange(7)

array([0, 1, 2, 3, 4, 5, 6])

In [128]:
pd.Series(np.arange(7))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

In [1]:
ts[1] # Series not support negative index

NameError: name 'ts' is not defined

In [14]:
import pandas as pd
import numpy as np
dates = pd.date_range('1/1/2000',periods=7)
ts = pd.Series(np.arange(1,8),index=dates) # index can be index=["s","ss","z"] it should be match no of column
ts

2000-01-01    1
2000-01-02    2
2000-01-03    3
2000-01-04    4
2000-01-05    5
2000-01-06    6
2000-01-07    7
Freq: D, dtype: int32

In [15]:
dates = pd.date_range('1/1/2000',periods=7)
ts = pd.Series(np.arange(1,8),index=["aa","bb","cc","dd","ee","ff","gg"])
ts

aa    1
bb    2
cc    3
dd    4
ee    5
ff    6
gg    7
dtype: int32

In [9]:
ts['aa'] # Accessing the data throug Index and default index will not accept

1

In [17]:
dates = pd.date_range('1/1/2000',periods=7)
ts = pd.Series(np.arange(1,8),index=dates)
ts.to_csv('tseries.csv',header=False)

In [18]:
ts

2000-01-01    1
2000-01-02    2
2000-01-03    3
2000-01-04    4
2000-01-05    5
2000-01-06    6
2000-01-07    7
Freq: D, dtype: int32

In [23]:
# Read csv file with out read_csv()
import csv
f = open('ex7.csv')
reader = csv.reader(f)
reader

In [24]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [25]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [76]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [77]:
pd.read_table('/Users/sudhanshukumar/Downloads/examples/ex1.csv', sep=',')

FileNotFoundError: [Errno 2] File /Users/sudhanshukumar/Downloads/examples/ex1.csv does not exist: '/Users/sudhanshukumar/Downloads/examples/ex1.csv'

In [ ]:
pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex2.csv', header=None)

In [ ]:
df =pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex2.csv', names=['asdfdsfs','fsdf', 'b', 'c', 'sudh', 'message'])
type(df)

In [ ]:
!cat /Users/sudhanshukumar/Downloads/examples/csv_mindex.csv

In [ ]:

parsed = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

In [ ]:
#!cat /Users/sudhanshukumar/Downloads/examples/ex4.csv
result = pd.read_csv('ex4.csv', skiprows=[0, 2, 3])
result

In [ ]:
!cat /Users/sudhanshukumar/Downloads/examples/ex5.csv
result = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex5.csv')
result
pd.isnull(result)

In [ ]:
result = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex5.csv', na_values=['NULL'])
result

In [ ]:
draft3 = pd.read_excel('/Users/sudhanshukumar/Downloads/Transactions_Zenapt.xlsx',sheetname = 'Expense') # Name of sheet to read from

draft3.head(6)

In [ ]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url

BB_data[0].ix[:, 0:20].head(5)      # Check 5 rows (10 columns only)

In [ ]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [ ]:
titanic_train.head(10)

In [ ]:
titanic_train[["Name","Pclass"]].head()

In [ ]:
titanic_train.dtypes

In [ ]:
pd.options.display.max_rows = 10

In [ ]:
result = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex6.csv')
result

In [ ]:
pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex6.csv', nrows=5)

In [ ]:
chunk = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex6.csv', chunksize=1000)
chunk

Writing Data to Text Format

In [ ]:
data = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex5.csv')
data

In [ ]:
data.to_csv('/Users/sudhanshukumar/Downloads/out.csv')
!cat /Users/sudhanshukumar/Downloads/out.csv

In [ ]:
import sys
data.to_csv('/Users/sudhanshukumar/Downloads/out1.csv', sep='@')

In [ ]:
data.to_csv(sys.stdout, na_rep='NULL')

In [ ]:
data.to_csv('/Users/sudhanshukumar/Downloads/out2.csv', index=False, header=False)

In [ ]:
data.to_csv('/Users/sudhanshukumar/Downloads/out3.csv', index=False, columns=['a', 'b', 'c'])

In [ ]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('/Users/sudhanshukumar/Downloads/examples/tseries.csv')
!cat /Users/sudhanshukumar/Downloads/examples/tseries.csv

Working with Delimited Formats

In [ ]:
import csv
f = open('/Users/sudhanshukumar/Downloads/examples/ex7.csv')

reader = csv.reader(f)
reader

In [ ]:
for line in reader:
    print(line)

In [ ]:
with open('/Users/sudhanshukumar/Downloads/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [ ]:
header, values = lines[0], lines[1:]

In [34]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

JSON Data

In [115]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [120]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [118]:
asjson = json.dumps(result)

In [122]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [123]:
!cat /Users/sudhanshukumar/Downloads/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [40]:
data = pd.read_json('/Users/sudhanshukumar/Downloads/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

XML and HTML: Web Scraping

In [126]:
tables = pd.read_html('/Users/sudhanshukumar/Downloads/examples/fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [129]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()
#close_timestamps

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

# Binary Data Formats

In [132]:
frame = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex1.csv')
frame
frame.to_pickle('/Users/sudhanshukumar/Downloads/examples/frame_pickle')

In [133]:
pd.read_pickle('/Users/sudhanshukumar/Downloads/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [141]:
!rm /Users/sudhanshukumar/Downloads/examples/frame_pickle

rm: /Users/sudhanshukumar/Downloads/examples/frame_pickle: No such file or directory

Using HDF5 Format

In [142]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [143]:
store['obj1']

           a
0   1.212260
1   1.438855
2  -0.426525
3   2.774679
4   1.090206
..       ...
95  2.261248
96 -1.936576
97  0.327743
98 -0.567130
99 -1.563750

[100 rows x 1 columns]

In [144]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [145]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.212260
1  1.438855
2 -0.426525
3  2.774679
4  1.090206

# Web APIs

In [146]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [150]:
data = resp.json()
data[2]['user']

{'login': 'erfannariman',
 'id': 34067903,
 'node_id': 'MDQ6VXNlcjM0MDY3OTAz',
 'avatar_url': 'https://avatars2.githubusercontent.com/u/34067903?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/erfannariman',
 'html_url': 'https://github.com/erfannariman',
 'followers_url': 'https://api.github.com/users/erfannariman/followers',
 'following_url': 'https://api.github.com/users/erfannariman/following{/other_user}',
 'gists_url': 'https://api.github.com/users/erfannariman/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/erfannariman/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/erfannariman/subscriptions',
 'organizations_url': 'https://api.github.com/users/erfannariman/orgs',
 'repos_url': 'https://api.github.com/users/erfannariman/repos',
 'events_url': 'https://api.github.com/users/erfannariman/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/erfannariman/received_events',
 'type': 'User',
 'site_admin': False}

In [151]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,29270,"Reduce Benchmark Times of stat_ops, particular...","[{'id': 732775912, 'node_id': 'MDU6TGFiZWw3MzI...",open
1,29269,Add simple test for GH 28448,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
2,29268,Named aggregations with multiple columns,[],open
3,29267,"API: public way to get the ""best values"" of a ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
4,29266,BLD: ABCSeries mapper maps unmapped categories...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
...,...,...,...,...
25,29229,API/DOC: an ExtensionDtype.__from_arrow__ meth...,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2...",open
26,29227,Replace _has_complex_internals with isinstance...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
27,29224,Period index 29204,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
28,29223,CI: include pyarrow 0.15.0 / latest release in...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
29,29218,ENH: Show column name in assert_frame_equal,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2...",open

# Interacting with Databases

In [153]:
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database4.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2.sqlite')
con.execute(query)
con.commit()

In [154]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [155]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [157]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [158]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database5.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [159]:
db.commit()

In [160]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(103, 'James', 80)
(104, 'Cathy', 85)
(105, 'Kris', 95)
------------------------------------------------------------

In [161]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

(102, 'Gary', 90)
------------------------------------------------------------

In [162]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(105, 'Kris', 95)
------------------------------------------------------------

In [163]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

('John', 99)
('Kris', 95)
('Gary', 90)
('Cathy', 85)
('James', 80)
------------------------------------------------------------

In [164]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)
------------------------------------------------------------

In [67]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)